doe/results_full/cases/case_04/constant/combustionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}

combustionModel none;
