doe/results_full/cases/case_04/Allrun
#!/usr/bin/env bash
# ---------------------------------------------------------------------------
#  Auto-generated by stamp_cases.py.  Runs the full pipeline for case 04
#   d/D = 0.2518   HBR = 19.45%   VR = 3.807
# ---------------------------------------------------------------------------
set -eo pipefail
cd "$(dirname "$0")"

# Source OpenFOAM (edit OPENFOAM_BASHRC if your install lives elsewhere).
# OpenFOAM's bashrc emits a harmless pop_var_context warning in
# non-interactive shells (and references an unset var); both trip
# `set -e` / `set -u`, so disable them around the source.
OPENFOAM_BASHRC="${OPENFOAM_BASHRC:-/usr/lib/openfoam/openfoam2406/etc/bashrc}"
set +eu
# shellcheck disable=SC1090
source "$OPENFOAM_BASHRC" 2>/dev/null
set -e

# Export per-case geometry for generateSTL.py
# shellcheck disable=SC1091
source ./case.env

# ----- optional mesh-reuse shortcut ---------------------------------------
# If $REUSE_MESH_FROM points to a case with the same d/D slice, copy its
# polyMesh + decomposed processor dirs; otherwise build from scratch.
if [[ "${REUSE_MESH_FROM:-}" != "" && -d "${REUSE_MESH_FROM}/constant/polyMesh" ]]; then
    echo "[case_04] reusing mesh from ${REUSE_MESH_FROM}"
    cp -r "${REUSE_MESH_FROM}/constant/polyMesh"      constant/
    cp -r "${REUSE_MESH_FROM}/constant/triSurface"    constant/ 2>/dev/null || true
    if compgen -G "${REUSE_MESH_FROM}/processor*" > /dev/null; then
        for p in "${REUSE_MESH_FROM}"/processor*; do
            dst="./$(basename "$p")"
            mkdir -p "$dst/constant"
            cp -r "$p/constant/polyMesh" "$dst/constant/"
        done
    fi
else
    echo "[case_04] building mesh from scratch"
    python3 generateSTL.py                                | tee log.generateSTL
    python3 scripts/clip_stls.py constant/triSurface   | tee log.clipStls
    surfaceFeatureExtract                                 | tee log.surfaceFeatureExtract
    blockMesh                                             | tee log.blockMesh
    snappyHexMesh -overwrite                              | tee log.snappyHexMesh
    # rescue branch_inlet faces from allBoundary fallback (see createPatchDict)
    if grep -q "allBoundary" constant/polyMesh/boundary; then
        createPatch -overwrite                            | tee log.createPatch
    fi
    checkMesh -allTopology -allGeometry                   | tee log.checkMesh
    decomposePar -force                                   | tee log.decomposePar
fi

# ----- initial field ------------------------------------------------------
# Always rebuild processor*/0 from the case-local 0/ template so field
# sizes match the (possibly reused) mesh.
rm -rf processor*/0 processor*/0.*
decomposePar -force                                   | tee log.decomposePar

# (potentialFoam warm-start removed -- it leaves rho with wrong dimensions
#  for rhoReactingBuoyantFoam.  High-VR startup is instead handled by
#  relaxation in fvSolution.)

# ----- main solver --------------------------------------------------------
mpirun --use-hwthread-cpus -n 16 rhoReactingBuoyantFoam -parallel    | tee log.solver

# ----- reconstruction + metrics -------------------------------------------
reconstructPar -latestTime                                | tee log.reconstructPar

echo "[case_04] SIM DONE at $(date +%FT%T)"
touch SIM_DONE
